#!/usr/bin/env python3

import re
from tables._表 import 表 as _表

class 表(_表):
	聲擬 = {'共': 'ɡ', '合': 'ɦ', '呆': 'ŋ', '亨': 'h', '按': '∅', '果': 'k', '康': 'kʰ', '求': 'dʑ', '諧': 'ɦʲ', '宜': 'ȵ', '曉': 'ɕ', '一': '∅ʲ', '荆': 'tɕ', '腔': 'tɕʰ', '但': 'd', '能': 'n', '來': 'l', '諦': 't', '聽': 'tʰ', '傳': 'dʒ', '授': 'ʒ', '勝': 'ʃ', '征': 'tʃ', '倡': 'tʃʰ', '濁': 'dz', '在': 'z', '先': 's', '之': 'ts', '請': 'tsʰ', '排': 'b', '明': 'm', '編': 'p', '配': 'pʰ', '無': 'v', '方': 'f', '狂': 'ɡʷ', '懷': 'ɦʷ', '頑': 'ŋʷ', '況': 'hʷ', '宛': '∅ʷ', '光': 'kʷ', '匡': 'kʰʷ'}
	濁音 = "共合呆求諧宜但能來傳授濁在排明無狂懷頑"
	韻擬 = {'音': 'in', '隨': 'ɐi', '泉': 'ᴇ', '更': 'aŋ', '何': 'ʊ', '法': 'aʔ', '畫': 'ɑʔ', '一': 'ieʔ', '翻': 'æ', '查': 'o', '諸': 'y', '聲': 'ən', '要': 'ɐɯ', '宜': 'i', '諧': 'ᴀ', '俗': 'oʔ', '從': 'oŋ', '吾': 'u', '方': 'ɑŋ', '言': 'ie', '求': 'ɤɯ', '而': '\u030D', '各': 'ɔʔ', '得': 'əʔ'}
	調擬 = {"平": 1, "上" : 3, "去": 5, "入": 7}
	調序 = "平上去"
	聲 = ""
	韻 = ""
	調 = ""
	呼序 = dict()

	def 擬音(自):
		音 = 自.聲 + 自.韻 + 自.調
		呼 = "開"
		介音 = ""
		if 自.呼序[音] > 0:
			呼 = "齊"
			介音 = "i"
		if 自.韻 in "音一宜言": 呼 = "齊"
		elif 自.韻 in "諸": 呼 = "撮"
		elif 自.韻 in "吾": 呼 = "合"
		elif 自.聲 in "狂懷頑況宛光匡":
			呼 = "合"
			介音 = "u"
		elif 自.聲 in "求諧宜曉一荆腔":
			呼 = "齊"
			介音 = "i"
			if 自.韻 in "泉法聲得":
				呼 = "撮"
				介音 = "y"
		elif re.match("^[但能來諦聽][畫]", 音):
			呼 = "齊"
			介音 = "i"
		elif re.match("^[請明][畫]", 音):
			if 自.呼序[音] == 0:
				呼 = "齊"
				介音 = "i"
			elif 自.呼序[音] == 1:
				呼 = "開"
				介音 = ""
		elif re.match("^[傳授勝征倡濁在先之請][泉聲得]", 音):
			if (自.呼序[音] == 2) or (自.呼序[音] == 1 and 音[:2] not in ("之泉", "征得", "傳得", "倡得", "在得", "之得")) or (自.呼序[音] == 0 and 音[:2] in ("之泉", "傳得", "倡得", "在得", "之得")):
				呼 = "撮"
				介音 = "y"
		音標 = 自.聲擬[自.聲] + 介音 + 自.韻擬[自.韻] + str(自.調擬[自.調] + int(自.聲 in 自.濁音))
		音標 = re.sub("([ʒʃ]ʰ?)(\u030D)", "\\1ʅ", 音標)
		音標 = re.sub("([zs]ʰ?)(\u030D)", "\\1ɿ", 音標)
		反切 = 自.聲 + 自.韻 + 呼 + 自.調
		return 音標, 反切

	def 統(自, 行):
		行 = _表.統(自, 行)
		# 行 = re.sub("\\(.*?\\)", "", 行)
		行 = re.sub("\\[.*?\\]", "", 行)
		行 = re.sub("<.*?>", "", 行)
		if 行.startswith("#"):
			行 = re.sub("\\(.*?\\)", "", 行)
			行 = 行.strip()
		if 行.startswith("## "):
			自.呼序.clear()
			自.韻 = 行[3:][-1]
		elif 行.startswith("### "):
			自.聲 = 行[4:]
		elif 行.startswith("#### "):
			調 = 行[5:].strip("【】")[0]
			if 調 == "・":
				自.調 = 自.調序[(自.調序.index(自.調)+1) % len(自.調序) if 自.調 in 自.調序  else 0]
			else: 自.調 = 調
			音 = 自.聲 + 自.韻 + 自.調
			if 音 not in 自.呼序: 自.呼序[音] = 0
			else: 自.呼序[音] += 1
		elif 行.startswith("- "): 行 = 行[2:]
		else: 行 = ""
		return 行

	def 析(自, 列):
		if "⮚" not in 列[0]: return
		l = list()
		音標, 反切 = 自.擬音()
		for i, j, k in re.findall("(.)(\\(.*?\\))?(⮚.+)?", 列[0]):
			k = k.replace("⮚", "")
			註 = f"{j}〔{反切}〕{k}"
			註 = re.sub(r"〔(.*?)〕(.*?)○", r"〔\1 \2〕", 註)
			l.append((i, 音標, 註))
		return l
