#!/usr/bin/env python3

def hex2chr(uni):
	"把unicode轉換成漢字"
	if uni.startswith("U+"): uni = uni[2:]
	return chr(int(uni, 16))

def cjkorder(s):
	n = ord(s)
	return n + 0x10000 if n < 0x4E00 else n

def getModules():
	#import pkgutil
	#return [name for _, name, _ in pkgutil.iter_modules([__name__]) if not name.startswith("_")]
	return ["漢字",
"兩分","五筆畫","說文","康熙","漢大",
"鄭張","白沙","廣韻","韻圖","中原音韻","老國音",
"普通話",
'濟南', '西安', '澄城王莊', '秦安郭嘉', '徐州', '贛楡', '銀川',
'文水開柵', '平遙', '介休', '沁源王陶', '文水裴會', '孝義', '孝義下堡', '孝義白壁關', '汾陽', '中陽', '佳縣佳蘆', '偏關', '大同', '陽原化稍營',
'祁門軍話', '信豐官話', '贛州官話', '華樓正話', '南平官話', '八所軍話',
'武漢', '新晃凳寨', '零陵', '象州中平', '象州納祿', '武鳴官話', '浪平高山漢話', '遵義', '桐梓婁山關', '綦江古南', '犍爲玉津',
'肥東古城', '南京', '江寧橫溪', '揚州', '儀眞', '海州', '淮安', '阜寧', '鹽城', '鹽城步鳳', '安慶', '懷寧高河', '興化', '南通', '泰如', '武穴花橋', 
'包場-餘東', '靖江', '金壇', '江陰', '淸末蘇州', '蘇州', '常熟東', '常熟唐市', '太倉鹿河', '上海江鎮', '上海川沙', '上海', '湖州','杭州', '富陽東梓關', 
'寧波','鎮海','北侖','舟山','岱山',
'臨海', '仙居', '縉雲', '武義', '遂昌', '雲和', '泰順羅陽', '松陽', '樂淸', '永嘉', '永強', '淸末溫州', '溫州', '瑞安東山', '瑞安陶山', '瑞安湖嶺', '平陽', '龍港', '文成', '蒼南宜山', '蒼南蒲門', '瑞安',
'浮梁舊城', '淳安淳城', '建德梅城', '建德壽昌', '遂安獅城', '蘭溪船上話', '屯溪船上話', 
'懷寧石牌', '太湖', '南昌', '高安楊墟', '臨川上頓渡', '餘干玉亭', '博羅', '四縣腔客語', '五華橫陂', '五華水寨', '海陸腔客語',
'香港', '南寧', '鬱林', '南寧亭子',
'長沙', '韶山', '韶山大坪', '衡山', #'湘潭',
'桂林平山土話', '江永上江圩',
'沅陵麻溪鋪', '沅陵淸水坪', '沅陵棋坪', '古丈高峰', '瀘溪八什坪', '瀘溪白沙',
'臺灣', '泉州', '廈門', '博羅泰美', '羅定漳州話', '潮州', '汕頭', '普寧', '饒平', '鳳凰-新豐', '惠來隆江', '潮陽', '雷州', '吳川蘭石', '電白龍山', '寧德', '蒼南錢庫', '建甌',
"越南","中世朝鮮","朝鮮",
"日語吳音","日語漢音","日語唐音","日語慣用","日語其他",
"總筆畫數","部首餘筆",
"倉三","倉五","倉六",
"五筆86","五筆98","五筆06",
"異體字","分類"
]

import importlib
def getLangs():
	langs = []
	for mod in getModules():
		try:
			langs.append(importlib.import_module(f"tables.{mod}").字表())
		except:
			print(f"未找到 {mod}")
	return langs
