#!/usr/bin/env python3

from tables._表 import 表 as _表

sms = {'p':'p', 'ph':'pʰ', 'b':'b', 'm':'m', 'pf':'pf', 'pfh':'pfʰ', 'bv':'bv', 't':'t', 'th':'tʰ', 'l':'l', 'n':'n', 'ts':'ts', 'tsh':'tsʰ', 'dz':'dz', 's':'s', 'k':'k', 'kh':'kʰ', 'g':'g', 'ng':'ŋ', 'h':'h', '':''}
yms = {'i':'i', 'u':'u', 'a':'a', 'ia':'ia', 'ua':'ua', 'o':'o', 'io':'io', 'e':'e', 'ue':'ue', 'ui':'ui', 'ai':'ai', 'uai':'uai', 'oi':'oi', 'iu':'iu', 'au':'au', 'iau':'iau', 'ou':'ou', 'im':'im', 'am':'am', 'iam':'iam', 'uam':'uam', 'om':'om', 'ing':'iŋ', 'ung':'uŋ', 'ang':'aŋ', 'iang':'iaŋ', 'uang':'uaŋ', 'ong':'oŋ', 'iong':'ioŋ', 'eng':'eŋ', 'ueng':'ueŋ', 'ip':'ip', 'ap':'ap', 'iap':'iap', 'uap':'uap', 'op':'op', 'ik':'ik', 'uk':'uk', 'ak':'ak', 'iak':'iak', 'uak':'uak', 'ok':'ok', 'iok':'iok', 'ek':'ek', 'uek':'uek', 'inn':'ĩ', 'ann':'ã', 'iann':'iã', 'uann':'uã', 'onn':'õ', 'ionn':'iõ', 'enn':'ẽ', 'uenn':'uẽ', 'uinn':'uĩ', 'ainn':'aĩ', 'uainn':'uaĩ', 'oinn':'oĩ', 'iunn':'iũ', 'aunn':'aũ', 'iaunn':'iaũ', 'ounn':'oũ', 'ih':'iʔ', 'uh':'uʔ', 'ah':'aʔ', 'iah':'iaʔ', 'uah':'uaʔ', 'oh':'oʔ', 'ioh':'ioʔ', 'eh':'eʔ', 'ueh':'ueʔ', 'oih':'oiʔ', 'iuh':'iuʔ', 'auh':'auʔ', 'iauh':'iauʔ', 'annh':'ãʔ', 'uannh':'uãʔ', 'iaunnh':'iaũʔ', 'ɿ':'ɿ', 'm':'m', 'ng':'ŋ', 'ək':'ək', 'aannp':'ãːp', 'annp':'ãp', 'uei':'uei', '':'', 'əŋ': 'əŋ', 'əng': 'əŋ'}

class 表(_表):
	note = "本文所記錄的潮陽話，是以峽山口音爲主，併兼合以潮陽話爲主的幾個代表性強的方言點（棉城、海門、陳店等）。潮陽話是潮汕話中比較獨特的存在，與其他潮汕口音有一定差異，主要體現在兩方面：<br>①聲調<br> 不同於潮汕主流腔的8本調，平上去入各分陰陽，絕大部分潮陽口音的本調都是7個，除海門外，絕大部分潮陽口音都是3/6本調混同的，即陰去/陽上本調不分，調值都發˥˩（51），但兩調可通過變調區分，因此本文依然將兩調分開，調類仍算8個，是假7調腔。海門口音與主流潮陽話不同，是1/6調不分，即陰平/陽上不分，調值都發˧˩（31），無論本調還是變調都不能區分，變調後都發˧（33），是真7調腔。本文采用的調值是以峽山新派爲準，之所以採用峽山新派是因爲他能更好地兼容潮陽境內的大部分潮陽口音，8個調類調值如下： 1.陰平˨˩（21）、陰上˥（55）、陰去˥˩（51）、陰入˧˨（32）、陽平˧（33）、陽上˥˩（51），陽去˧˧˩（331）、陽入˥（55）<br> ②重脣音+u輕脣化<br> 不同於潮汕主流腔“無輕脣音”的特點，潮陽話在近一百年裏發生了重脣音聲母p、ph、b、m接u時輕脣化的音變，雖然此音變在峽山最老派中基本沒有發生，但由於操此派音的人已經很少了，因此本文仍以發生此音變的大衆音爲準。不過輕脣化是屬於正在進行的音變，老派與新派之間音值存在差異，老派發音更接近於純重脣音，新派則更接近於純輕脣音，而中派介於兩者之間，有過渡性質，且中派音相對大衆一點，因此本文的輕脣音以中派爲準［pf、pfʰ、bv］。m+u時雖也有輕脣化的音變［ɱ］，但它的輕脣化最弱，聽感上接近於純重脣音［m］，且很多時候也常發成純重脣音，因此本文記爲純重脣音［m］。 另，潮汕話基本聲母有17個，加上零聲母則有18個，零聲母發音前有個先喉塞音［ʔ］，潮陽話由於發生了重脣音輕脣化的音變，因此多出來四個輕脣音聲母，與純重脣音聲母互補 最後一點，一些讀音的釋義處有“夢幻島音”的註明，其所指的是“棉城+海門+達濠”這三個地方。"

	def parse(self, fs):
		_,hz,js,yb,sm,ym,sd = fs[:7]
		if len(hz) != 1: return
		ym = ym.rstrip("12345678")
		sd = sd.strip()
		yb = sms[sm] + yms[ym] + sd
		p = "%s\t%s" % (yb, js)
		return hz, yb, js
