#!/usr/bin/env python3

from tables._表 import 表 as _表

class 表(_表):
	note = "声母说明：<br>①［ts tsʰ dz s］在和齐齿呼韵母相拼时，实际音值是［tɕ tɕʰ dʑ ɕ］。<br>②［m n ŋ］只和鼻化韵相拼，［b l ɡ］只和非鼻化韵相拼。［b l ɡ］的实际音值是鼻冠音［mb nd ŋɡ］(参见胡方(2005)对厦门方言［b l ɡ］声母的分析)。<br>③零声母有时带有轻微的喉塞音［ʔ］。<br>韵母说明：<br>①［o］韵母开口度偏大，双唇较松弛。<br>②主要发音人［ɔ］韵母有时说［ɔu］，如□<衣服下摆>［pɔu13］≠□<丝瓜囊>［pɔ13］，戽［hɔu21］，哺<咀嚼>步［pɔu22］，但三位发音人均未意识到这一差别。另两位发音人不存在这个现象。<br>③宕摄开口三等阳声韵字两位参考发音人说［iõ］;主要发音人大部分字说［iõ］，部分字(桨、梁、量动词)［iũ］，部分字(姜、酱、让、象、痒)［iõ］［iũ］两可。本文记录以主要发音人的发音为准，两可的字都记为［iõ］。<br>④［it］韵腹开口度较大，实际音值是［ɪt］。<br>⑤［ian iat］韵母的实际音值分别是［ien iet］。<br>⑥鼻化韵母的鼻音贯穿整个音节，我们将鼻化符号记录在韵母的主要元音上。<br>⑦声化韵［ŋ］与声母之间紧密相连，舌位无明显变动，其间并无“类似［ə］的流音”。(罗常培1930/1999)。<br>声调说明：<br>①阳平调13强调时调值为113。<br>②阳入调231不如阴入31短促，可拉长，拉长时音值为221。"
	toneValues = {"44":1, "13":2, "53":3, "21":5, "22":6, "31":7, "231":8}

	def parse(self, fs):
		_yb, hz,js = fs[:3]
		yb = _yb.strip("012345")
		sd = _yb[len(yb):]
		if sd in self.toneValues:
			sd = str(self.toneValues[sd])
		else:
			sd = ""
		yb = yb + sd
		p = "%s\t%s" % (yb, js)
		return hz, yb, js
